In [4]:
# 1.Write a function that accepts *args and returns their sum.

def sum_of_num(*args):
    return sum(args)
print(sum_of_num(1,2,3,4,5))

15

In [5]:
# 2.Write a function to reverse a string

def reverse_str(a):
    return(a[::-1])
reverse_str("python")

'nohtyp'

In [8]:
# 3 Write a function to check if a string is a palindrome.

def palin(a):
    if a == a [::-1]:
        print("its palindrome")
    else:
        print("its not palindrome")
palin("madam")

its palindrome

In [7]:
# 4. Write a function to count vowels in a string.
def checkvowel(a):
    string = a.lower()
    count = 0
    for char in string:
        if char in "aeiou":
            count += 1
    return count
checkvowel("nature is beutiful")

8

In [21]:
# 5.Write a function that returns the larger of two numbers
def large_no(a,b):
    a = int(a)
    b = int(b)
    if a >= b:
        print("number is:",a)
    else:
        print("number is:",b)
large_no("34","39")

number is: 39

In [27]:
#write a recursive function to count the number of digits in an integer

def count_int(a):
    if a == 0:
        return 0
    else:
        return 1 + count_int(a % 10)
print(count_int(12345))

RecursionError: maximum recursion depth exceeded

In [30]:
#Write a recursive function to check if a number is even (without using %).

def check_int(a):
    if a == 0:
        return True
    elif a == 1:
        return False
    return check_int(a - 2)
print(check_int(5))

False

In [34]:
#Write a recursive function to check if a number is even (without using %).

def check_val(a):
    if a % 2 == 0:
        print("even")
    else:
        print("odd")
check_val(33)
check_val(20)

odd
even

In [36]:
#Write a recursive function to sum even numbers from 1 to n.
def even_num(a):
    if a == 0:
        return 0
    else:
        a % 2 == 1:
        return even_num(a - 1)
print(sum_even(10))

SyntaxError: invalid syntax (1866082461.py, line 6)

In [61]:
#Write a function that checks if a year is a leap year.

def leap_year(a):
    if ( a % 4 == 0):
        print("this is a leap year")
    else:
        print("this is not leap year")
leap_year(2023)

this is not leap year

In [62]:
#Write a function to calculate the average of numbers in a list.

def average_num(a):
    if a == 0:
        return 0
    else:
        return sum(a) / len(a)
list = [10,20,30,40]
print(average_num(list))

25.0

In [11]:
password = input("enter your password:")
    if len(password) < 8:
        print("password must be 8 character long")
    elif password any(char.isupper() for char in password):
        print("at least one uppercase letter needed")
    elif password any(char.islower() for char in password):
        print("at least one lowercase leeted needed")
    elif password any(char.isdigit() for char in password):
        print("at least one digit is needed")
    else:
        print("password is valid")

IndentationError: unexpected indent (2435219092.py, line 2)

In [8]:
password = input("Enter your password: ")
if len(password) >= 8:
    has_upper = False
    has_lower = False
    has_digit = False
    
    for char in password:
        if char.isupper():
            has_upper = True
        elif char.islower():
            has_lower = True
        elif char.isdigit():
            has_digit = True

    if has_upper and has_lower and has_digit:
        print("Password is valid.")
    else:
        print("Password is invalid.")
else:
    print("Password is invalid.")

Enter your password:  tanmlabca@98898

Password is invalid.

In [26]:
def anagram(str1 , str2):
    str1 = str1.lower()
    str2 = str2.lower()
    if sorted(str1) == sorted(str2):
        print("this is anagram")
    else:
        print("this is not anagram")
str1 = input("enter your first string: ")
str2 = input("enter your second string: ")
anagram(str1,str2)

enter your first string:  silent
enter your second string:  listen

this is anagram

In [4]:
#Write a Python Program to Reverse a Number Using String Slicing

num = "12345"
reverse = num[::-1]
print(reverse)

54321

In [14]:
#Write a Python program to Merge Two Sorted Lists

lst_1 = [1,2,3,4]
lst_2 = [5,6,7,8]

merge = lst_2 + lst_1
print(f"merged list is: {merge}")

merged list is: [5, 6, 7, 8, 1, 2, 3, 4]

In [ ]:
#Write a Python Program to Merge Two Dictionaries

dict1 =

In [2]:
# Write a Python program to access a function inside a function.

def outer():
    def inner():
        print("hello")
    inner()
outer()

hello

In [9]:
def show_line(language):
    def in_letters():
        print("Hello")
    def in_numbers():
        print("12345")
    if language == "num":
        in_numbers()
    else:
        in_letters()

show_line("")

Hello

In [12]:
def shiw_line(language):
    def in_letter():
        print("hello")
    def in_num():
        print("12345")
    if language == "num":
        in_number()
    else:
        in_letter()

show_line("num")

12345

In [9]:
import pandas as pd

a = pd.DataFrame([20,30,40,50])
print(a)

b = pd.Series([120,130,140,150,160], index=['A', 'B', 'C', 'D','E'])

print(b)

    0
0  20
1  30
2  40
3  50
A    120
B    130
C    140
D    150
E    160
dtype: int64

In [1]:
import pandas as pd

a = {
    "Emp_name": ["tanmay","ajay","kushal","devesh","kiran","aishwarya","kanchan","suraj","garima","rahul","kishor","virendra","thushara","dhanashree","praneta","neeraj","yogesh","gopal","sanket","yash"],
    "Emp_age": [22,23,35,40,25,45,50,21,23,24,25,26,27,45,54,37,54,34,43,41],
    "EmpCity": ["pune","karnataka","goa","satara","sangli","kerala","kochi","punjab","kulu","manali","dehradun","vizag","banglore","noida","delhi","mumbai","chennai","jaipur","mirzapur","wassepur"],
    "Emp_ID" : ["us795","wu508","aj68s","kd368","rv769","uv999","vu001","hx999","aa001","ol615","np222","jp877","xr971","lo099","hi063","nl685","fo671","ro677","ey847","va888"],
    "Emp_Dept": ["all","network","vip","meeting","eucdept","helpeingdept","cleaning","printerservice","finance","cgsa","gcc","global","IT service","Tax","careteam","manufacuring","buyer","legal","abo","payment team"],
    "Emp_designation": ["executive","manager","junior manager","hr","helper","cleaner","printer","laptop","finance person","calling","IT head","IT service owner","Network Owner","staff associate","CWK","Indirect Tax","legal associate","payment leader","leader","associate"],
    "Emp_salary": [23000,25000,20000,30000,80000,10000,20000,10000,35000,100000,560000,230000,75000,48000,68000,120000,50000,84000,10000,32000]
}

df = pd.DataFrame(a)
print(df)

      Emp_name  Emp_age    EmpCity Emp_ID        Emp_Dept   Emp_designation  \
0       tanmay       22       pune  us795             all         executive
1         ajay       23  karnataka  wu508         network           manager
2       kushal       35        goa  aj68s             vip    junior manager
3       devesh       40     satara  kd368         meeting                hr
4        kiran       25     sangli  rv769         eucdept            helper
5    aishwarya       45     kerala  uv999    helpeingdept           cleaner
6      kanchan       50      kochi  vu001        cleaning           printer
7        suraj       21     punjab  hx999  printerservice            laptop
8       garima       23       kulu  aa001         finance    finance person
9        rahul       24     manali  ol615            cgsa           calling
10      kishor       25   dehradun  np222             gcc           IT head
11    virendra       26      vizag  jp877          global  IT service owner
12    thushara       27   banglore  xr971      IT service     Network Owner
13  dhanashree       45      noida  lo099             Tax   staff associate
14     praneta       54      delhi  hi063        careteam               CWK
15      neeraj       37     mumbai  nl685    manufacuring      Indirect Tax
16      yogesh       54    chennai  fo671           buyer   legal associate
17       gopal       34     jaipur  ro677           legal    payment leader
18      sanket       43   mirzapur  ey847             abo            leader
19        yash       41   wassepur  va888    payment team         associate

    Emp_salary
0        23000
1        25000
2        20000
3        30000
4        80000
5        10000
6        20000
7        10000
8        35000
9       100000
10      560000
11      230000
12       75000
13       48000
14       68000
15      120000
16       50000
17       84000
18       10000
19       32000

In [29]:
df.tail()

   Emp_name Emp_age   EmpCity Emp_ID      Emp_Dept  Emp_designation Emp_salary
15   neeraj      37    mumbai  nl685  manufacuring     Indirect Tax       1.2l
16   yogesh      54   chennai  fo671         buyer  legal associate        50k
17    gopal      34    jaipur  ro677         legal   payment leader        84k
18   sanket      43  mirzapur  ey847           abo           leader        10k
19     yash      41  wassepur  va888  payment team        associate        32k

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Emp_name         20 non-null     object
 1   Emp_age          20 non-null     object
 2   EmpCity          20 non-null     object
 3   Emp_ID           20 non-null     object
 4   Emp_Dept         20 non-null     object
 5   Emp_designation  20 non-null     object
 6   Emp_salary       20 non-null     object
dtypes: object(7)
memory usage: 1.2+ KB

In [17]:
df.describe()

         Emp_age     Emp_salary
count  20.000000      20.000000
mean   34.700000   81500.000000
std    11.225441  123962.430641
min    21.000000   10000.000000
25%    24.750000   22250.000000
50%    34.500000   41500.000000
75%    43.500000   81000.000000
max    54.000000  560000.000000

In [20]:
df.isnull().sum()

Emp_name           0
Emp_age            0
EmpCity            0
Emp_ID             0
Emp_Dept           0
Emp_designation    0
Emp_salary         0
dtype: int64

In [14]:
df.duplicated().sum()

0

In [19]:
df.duplicated('Emp_name').sum()

0

In [18]:
df.describe()

         Emp_age     Emp_salary
count  20.000000      20.000000
mean   34.700000   81500.000000
std    11.225441  123962.430641
min    21.000000   10000.000000
25%    24.750000   22250.000000
50%    34.500000   41500.000000
75%    43.500000   81000.000000
max    54.000000  560000.000000

In [12]:
# described for Emp_salary   - 1. The above table presents salary information for 20 employees.
# 2. The salary amounts are given in two formats: some in thousands (denoted by ‘k’) and others in lakhs (denoted by ‘l’).
# 3. For example, a salary listed as 23k represents ₹23,000, while 5.6l represents ₹5,60,000.
# 4. According to the data, there are three employees earning ₹10,000 each — making them the lowest-paid group. The highest-paid employee receives a salary of ₹5.6 lakh per month.
# 5. The average (mean) salary calculated from the dataset is ₹77,150.

In [2]:
df.head()

  Emp_name  Emp_age    EmpCity Emp_ID Emp_Dept Emp_designation  Emp_salary
0   tanmay       22       pune  us795      all       executive       23000
1     ajay       23  karnataka  wu508  network         manager       25000
2   kushal       35        goa  aj68s      vip  junior manager       20000
3   devesh       40     satara  kd368  meeting              hr       30000
4    kiran       25     sangli  rv769  eucdept          helper       80000

In [4]:
df.shape

(20, 7)

In [5]:
df.columns

Index(['Emp_name', 'Emp_age', 'EmpCity', 'Emp_ID', 'Emp_Dept',
       'Emp_designation', 'Emp_salary'],
      dtype='object')

In [6]:
df.index

RangeIndex(start=0, stop=20, step=1)

In [7]:
df.isnull().sum()

Emp_name           0
Emp_age            0
EmpCity            0
Emp_ID             0
Emp_Dept           0
Emp_designation    0
Emp_salary         0
dtype: int64

In [8]:
df.duplicated().sum

<bound method Series.sum of 0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
dtype: bool>

In [9]:
df.nunique()

Emp_name           20
Emp_age            16
EmpCity            20
Emp_ID             20
Emp_Dept           20
Emp_designation    20
Emp_salary         17
dtype: int64

In [10]:
df.value_counts()

Emp_name    Emp_age  EmpCity    Emp_ID  Emp_Dept        Emp_designation   Emp_salary
aishwarya   45       kerala     uv999   helpeingdept    cleaner           10000         1
ajay        23       karnataka  wu508   network         manager           25000         1
yash        41       wassepur   va888   payment team    associate         32000         1
virendra    26       vizag      jp877   global          IT service owner  230000        1
thushara    27       banglore   xr971   IT service      Network Owner     75000         1
tanmay      22       pune       us795   all             executive         23000         1
suraj       21       punjab     hx999   printerservice  laptop            10000         1
sanket      43       mirzapur   ey847   abo             leader            10000         1
rahul       24       manali     ol615   cgsa            calling           100000        1
praneta     54       delhi      hi063   careteam        CWK               68000         1
neeraj      37       mumbai     nl685   manufacuring    Indirect Tax      120000        1
kushal      35       goa        aj68s   vip             junior manager    20000         1
kishor      25       dehradun   np222   gcc             IT head           560000        1
kiran       25       sangli     rv769   eucdept         helper            80000         1
kanchan     50       kochi      vu001   cleaning        printer           20000         1
gopal       34       jaipur     ro677   legal           payment leader    84000         1
garima      23       kulu       aa001   finance         finance person    35000         1
dhanashree  45       noida      lo099   Tax             staff associate   48000         1
devesh      40       satara     kd368   meeting         hr                30000         1
yogesh      54       chennai    fo671   buyer           legal associate   50000         1
Name: count, dtype: int64

In [11]:
df.empty

False

In [12]:
df.sample()

  Emp_name  Emp_age EmpCity Emp_ID  Emp_Dept Emp_designation  Emp_salary
6  kanchan       50   kochi  vu001  cleaning         printer       20000

In [14]:
df['Emp_name']

0         tanmay
1           ajay
2         kushal
3         devesh
4          kiran
5      aishwarya
6        kanchan
7          suraj
8         garima
9          rahul
10        kishor
11      virendra
12      thushara
13    dhanashree
14       praneta
15        neeraj
16        yogesh
17         gopal
18        sanket
19          yash
Name: Emp_name, dtype: object

In [18]:
df[['Emp_age','Emp_Dept','Emp_name']]

    Emp_age        Emp_Dept    Emp_name
0        22             all      tanmay
1        23         network        ajay
2        35             vip      kushal
3        40         meeting      devesh
4        25         eucdept       kiran
5        45    helpeingdept   aishwarya
6        50        cleaning     kanchan
7        21  printerservice       suraj
8        23         finance      garima
9        24            cgsa       rahul
10       25             gcc      kishor
11       26          global    virendra
12       27      IT service    thushara
13       45             Tax  dhanashree
14       54        careteam     praneta
15       37    manufacuring      neeraj
16       54           buyer      yogesh
17       34           legal       gopal
18       43             abo      sanket
19       41    payment team        yash

In [17]:
df.iloc[17]

Emp_name                    gopal
Emp_age                        34
EmpCity                    jaipur
Emp_ID                      ro677
Emp_Dept                    legal
Emp_designation    payment leader
Emp_salary                  84000
Name: 17, dtype: object

In [21]:
Q1_p = df['Emp_salary'].quantile(0.25)
Q3_p = df['Emp_salary'].quantile(0.75)
IQR = Q3_p - Q1_p

lower_limit = Q1_p - 1.5 * IQR
upper_limit = Q3_p + 1.5 * IQR
print(IQR)

p_outlier = df[(df['Emp_salary'] < lower_limit) | (df['Emp_salary'] > upper_limit)]
print(p_outlier)

58750.0
    Emp_name  Emp_age   EmpCity Emp_ID Emp_Dept   Emp_designation  Emp_salary
10    kishor       25  dehradun  np222      gcc           IT head      560000
11  virendra       26     vizag  jp877   global  IT service owner      230000

In [23]:
df.sort_values(by = "Emp_ID", ascending= True)

,Emp_name,Emp_age,EmpCity,Emp_ID,Emp_Dept,Emp_designation,Emp_salary
8,garima,23,kulu,aa001,finance,finance person,35000
2,kushal,35,goa,aj68s,vip,junior manager,20000
18,sanket,43,mirzapur,ey847,abo,leader,10000
16,yogesh,54,chennai,fo671,buyer,legal associate,50000
14,praneta,54,delhi,hi063,careteam,CWK,68000
7,suraj,21,punjab,hx999,printerservice,laptop,10000
11,virendra,26,vizag,jp877,global,IT service owner,230000
3,devesh,40,satara,kd368,meeting,hr,30000
13,dhanashree,45,noida,lo099,Tax,staff associate,48000
15,neeraj,37,mumbai,nl685,manufacuring,Indirect Tax,120000
10,kishor,25,dehradun,np222,gcc,IT head,560000
9,rahul,24,manali,ol615,cgsa,calling,100000
17,gopal,34,jaipur,ro677,legal,payment leader,84000
4,kiran,25,sangli,rv769,eucdept,helper,80000
0,tanmay,22,pune,us795,all,executive,23000
5,aishwarya,45,kerala,uv999,helpeingdept,cleaner,10000
19,yash,41,wassepur,va888,payment team,associate,32000
6,kanchan,50,kochi,vu001,cleaning,printer,20000
1,ajay,23,karnataka,wu508,network,manager,25000
12,thushara,27,banglore,xr971,IT service,Network Owner,75000

In [24]:
df["ranking_price"] = df['Emp_designation'].rank(ascending = False)
df["ranking_price"]

0     12.0
1      4.0
2      8.0
3      9.0
4     10.0
5     13.0
6      2.0
7      7.0
8     11.0
9     14.0
10    19.0
11    18.0
12    16.0
13     1.0
14    20.0
15    17.0
16     5.0
17     3.0
18     6.0
19    15.0
Name: ranking_price, dtype: float64

In [33]:
df.get('Emp_Depts', default = "No Emp_Depts Column Available")

'No Emp_Depts Column Available'

In [34]:
df.groupby("Emp_name") ["Emp_salary"].min()

Emp_name
aishwarya      10000
ajay           25000
devesh         30000
dhanashree     48000
garima         35000
gopal          84000
kanchan        20000
kiran          80000
kishor        560000
kushal         20000
neeraj        120000
praneta        68000
rahul         100000
sanket         10000
suraj          10000
tanmay         23000
thushara       75000
virendra      230000
yash           32000
yogesh         50000
Name: Emp_salary, dtype: int64